Repository: JamesJulius/Tinamit
Catalog: docs/source/_local/*/LC_MESSAGES/desarrollo/des_bf.po
Languages: ur

source: Agregar modelos biofísicos
ur: بائیو فیزیکل نمونہ شامل کريں ۔

source: Cada modelo biofísico en Tinamït necesita una envoltura específica para él. Es por esta envoltura que Tinamït sabrá cómo controlar el modelo biofísico, cómo leer sus egresos y cómo actualizarlos con los valores del modelo DS. Visto que la gran mayoría de modelos biofísicos están escritos en lenguas compiladas y por veces oscuras, esta es la parte la más difícil de usar Tinamït. Lo bueno es que solamente se tiene que hacer una vez por cada *tipo* de modelo biofísico, y que Tinamït ya viene con algunos prehechos. Si vas a tener que crear una nueva envoltura para ti, por favor no dudes en compartirla.
ur: ٹينامٹ میں ہر حیاتیاتی ماڈل کے لئے مخصوص سانچھے کی ضرورت ہے. يہ سا نچھا اس ليے ضروری ہے کہ يہ حیاتیاتی ماڈل کا کنڑول ٹينامٹ کے ذريعے کرنے ميں مدد فراہم کرے گا۔ مثال کے طور پر اس کے اخراجات حیاتیاتی ماڈل کے ا‍قدار کیسے پڑھتے ہیں اور ان کو متحرک ماڈل کی اقدار کے ساتھکیسے تاذہ کریں گے. اس بات کو تسلیم کیا گیا ہے کہحیاتیاتی ماڈلوں کی اکثریت کو غیر مرتب شدہ اور کبھی کبھی غیر واضح زبانوں میں لکھا جاتا ہے، یہ ٹينامٹ استعمال کرنے کا سب سے مشکل حصہ ہے. اچھی بات یہ ہے کہ یہ ایک حیاتیاتی ماڈل کی ايک * قسم * کے لئے صرف ایک بار ہی کرنا ہوگا، اور یہ کہ یہ متحرک ماڈل کے ليےٹينامٹ ميں پہلے سے ہی بنا دیا ہے. اگر آپ کو آپ کے لئے ایک نيا سا نچھا بنانا ہے تو براہ مہربانی اس کے ليے ہم سے اشتراک کرنے میں ہچکچاہٹ محسوس نہ کريں.

source: Cómo crear una nueva envoltura
ur: نئی لپیٹ کیسے بنائیں۔

source: En teoría, es muy fácil. Simplemente tienes que crear una nueva subclase de la clase :class:`~tinamit.BF.ModeloBF` y después implementar allí las funciones que faltan. Si tienes un modelo que no se comporte tan bien, también puedes usar como plantilla una de las subclases de :class:`~tinamit.BF.ModeloBF` que ya hemos escrito para para facilitarte la vida. (Fue un placer.)
ur: اصل میں یہ بہت آسان ہے. آپ کو صرف طبقے کا ایک نیا ذیلی طبقہ بنانا ہوگا :class:`~tinamit.BF.ModeloBF` اور پھر اس ميں لاپتہ افعال کو لاگو کرناہو گا۔ اگر آپ کے پاس ایک ایسا ماڈل ہے جس کے ساتھ------ تو آپ ایک ذیلی کلاسک میں سے ایک کو ایک سانچے کے طور پر بھی استعمال کرسکتے ہیں۔ ہم نے طبقہ :class:`~tinamit.BF.ModeloB: آپکی آسانی کے لئے پہلےسے ہی لکھا ہے۔ (یہ ایک اچھی خبر ہے) ۔

source: ¿Cómo escojo la mejor plantilla?
ur: میں بہترین سانچہ کیسے منتخب کروں؟

source: Para ayudarte a decidir cuál plantilla es mejor para ti, consulta el cuestionario siguiente.
ur: یہ فیصلہ کرنے کیلئے کہ آپکے لئے کون سا سانچے بہتر ہے، مندرجہ ذیل سوالنامہ دیکھیں.

source: Mi modelo avanza con el **mismo paso que la precisión de sus egresos e ingresos**. Por ejemplo, tengo un modelo de poblaciones de insectos que puede avanzar con un paso de 1 mes y me da las poblaciones. Entonces, utilizar la plantilla estándar :class:`~tinamit.BF.ModeloBF`. Más detalles :ref:`abajo <plantilla_modbf>`.
ur: میرے ماڈل کی پیش رفت ٭٭ اغداد اور ‎‎‎‎‎‎‎شمار کی درستگی کے ليے ایک جيسا قدم٭٭۔ مثال کے طور پر، میرے پاس کیڑوں کی آبادی کا ایک نمونہ ہے جو ایک ماہ کے قدم سے آگے بڑھا اور مجھے آبادی دیتا ہے. پھر، معیاری سانچے کا استعمال کریں۔ 'class:`~tinamit.BF.ModeloBF: مزید تفصیلات کے ليے 'ref:`abajo:

source: Mi modelo avanza con un paso **superior a la precisión de sus egresos o ingresos**. Por ejemplo, mi modelo de salinidad de los suelos avanza por un paso mínimo de 1 año, pero después me da predicciones de salinidad distintas para dos estaciones de 6 meses cada una. Entonces, utilizar :class:`~tinamit.BF.ModeloImpaciente`. Más detalles :ref:`abajo <plantilla_modimp>`.
ur: میرا نمونہمختلف قدم سے آگے چلتا ہے٭٭آپ کے اعداد و ‎‎‎‎شمار کی درستگی سے مختلف٭٭۔ مثال کے طور پر، میری زمین کے نمونے کی کم از کم پیش رفت ايک سال کاقدم ہے، لیکن اس کے بعد مجھے ايک سال میں چھ ماہ کے دوقدم درکار ہيں۔ اس صورت ميں استعمال کریں۔ 'class:`~tinamit.BF.ModeloImpaciente:۔ مزید تفصیلات کے ليے 'ref:`abajo:۔

source: Mi modelo avanza con un **paso variable**. Por ejemplo, mi modelo de cultivos corre hasta la cosecha, la cual varía según el cultivo y el clima. Entonces, utilizar :class:`~tinamit.BF.ModeloFlexible`. Más detalles :ref:`abajo <plantilla_modflex>`.
ur: میرا ماڈل ایک٭٭متغیر قدم٭٭ کے ساتھ پیش رفت کرتا ہے۔مثال کے طور پر، میری فصل کا نمونہ فصل سےفصل تک چلتا ہے، جس میں فصل اور آب و ہوا ميں فرق ہوتا ہے۔ اس صورت ميں استعمال کریں۔ 'class:`~tinamit.BF.ModeloFlexible: مزید تفصیلات کے ليے 'ref:`abajo:۔

source: Si todavía no estás segura, empieza con :class:`~tinamit.BF.ModeloBF`. Saberás que no fue la buena decisión por quedarte muy confundida muy pronto.
ur: اگر آپ ابھی تک بے یقینی ميں ہیں۔ تو شروع کریں۔ 'class:`~tinamit.BF.ModeloBF:۔ آپ کو محسوس ہو گا کہ الجھن میں رہنے کافیصلہ اچھا نہیں تھا.

source: Puedes escribir tu envoltura en cualquier archivo (hacia no tiene que ser en el código fuente de Tinamït sí mismo). La subclase incluida es este archivo, o su implementación final, **debe** llamarse ``Modelo``. Si se llama cualquier otra cosa, no funcionará.
ur: آپ کسی بھی دستاويز میں اپنی جلد لکھ سکتے ہیں (ٹينامٹ کے ذریعہ کوڈ میں ہونا ضروری نہیں ہے)۔ شامل ذیلی طبقہ یہ دستاويز ہو گی ، اس کا آخری عمل، ** debe ** یا "Modelo" کہا جانا چاہیے. اگر آپ کچھ اور کہتے ہیں تو یہ کام نہیں کرے گا.

source: En teoría puedes implementar cualquier modelo con la plantilla estándar (todas las otras son subclases de esta), pero las otras te ahorarán mucho tiempo para modelos con pasos complicados.
ur: بنيادی طور پر آپ معیاری سانچے کے ساتھ کسی بھی ماڈل پر عمل درآمد کر سکتے ہیں (سب اس کے ليے آزمودہ ہیں) ۔ لیکن دوسروں کے ليے پیچیدہ اقدامات کے ساتھ نمونے تيار کرنے ميں بہت وقت بچا ئے گا.

source: Plantilla estándar (ModeloBF)
ur: معیاری سانچے (آب و ہوا کا نمونہ)

source: Esta plantilla es la más sencilla (y todas las otras son subclases de esta). Deberás implementar las funciones siguientes en una subclase de esta plantilla.
ur: یہ سانچے آسان ہيں (اور باقی سب اس کے ذیلی ٹکڑے ہیں). آپ کو اس سانچے کی ذیلی درجے میں درج ذیل افعال کو لاگو کرنا ضروری ہے۔

source: :func:`~tinamit.BF.ModeloBF.unidad_tiempo`: Devuelve la unidad de tiempo del modelo.
ur: ماڈل کا وقت یونٹ واپس کرتا ہے۔ :func:`~tinamit.BF.ModeloBF.unidad_tiempo`:

source: :func:`~tinamit.BF.ModeloBF._inic_dic_vars`: Incializa el diccionario interno de variables disponibles.
ur: دستیاب متغیر کی اندرونی لغت کو شروع کریں۔ :func:`~tinamit.BF.ModeloBF._inic_dic_vars`:

source: :func:`~tinamit.BF.ModeloBF.iniciar_modelo`: Inicializa la simulación.
ur: تخروپن کو شروع کریں۔ :func:`~tinamit.BF.ModeloBF.iniciar_modelo`:

source: :func:`~tinamit.BF.ModeloBF._cambiar_vals_modelo_interno`: Cambia los valores internos de los variables.
ur: متغیرات کی اندرونی اقدار کو تبدیل کریں۔ :func:`~tinamit.BF.ModeloBF._cambiar_vals_modelo_interno`:

source: :func:`~tinamit.BF.ModeloBF.incrementar`: Avanza el modelo.
ur: نمونے پیش کریں۔ :func:`~tinamit.BF.ModeloBF.incrementar`:

source: :func:`~tinamit.BF.ModeloBF.leer_vals`: Lee los egresos del modelo.
ur: نمونے کا راستہ پڑھیں۔ :func:`~tinamit.BF.ModeloBF.leer_vals`:

source: :func:`~tinamit.BF.ModeloBF.cerrar_modelo`: Cierre el modelo al final de una simulación.
ur: تخروپن کے آخر میں نمونے کو بند کریں۔ :func:`~tinamit.BF.ModeloBF.cerrar_modelo`:

source: Plantilla ModeloImpaciente
ur: بے معنی سانچہ

source: Un ejemplo del uso de esta plantilla es la envoltura para el modelo de salinidad de suelos SAHYSMOD. La plantilla maneja el control del modelo, incluso su simulación y la lectura retrospectiva de valores de variables para distintos meses o estaciones, de manera automática. Simplemente debes implementar las funciones siguientes en una subclase:
ur: اس سانچے کے استعمال کی ایک مثال مٹی ميں نمکينی حانچنے کے ليے نمونہ SAHYSMOD ہے. سانچہ نمونے کے تخروپن اور مختلف مہینوں یا موسموں کے لئے متغیر اقدار کے اعدادوشمار خود کار طریقے سے پڑھنے سمیتاسکا کنٹرول قائم کرتا ہے۔ آپ کواس ذیلی طبقے میں مندرجہ ذیل افعال کو لاگو کرنا ہوگا:

source: :func:`~tinamit.BF.ModeloImpaciente.iniciar_modelo`: Inicializa la simulación.
ur: تخروپن کو شروع کریں۔ 'func:`~tinamit.BF.ModeloImpaciente.iniciar_modelo:

source: :func:`~tinamit.BF.ModeloImpaciente.cerrar_modelo`: Cierre el modelo al final de una simulación.
ur: تخروپن کے اختتام پر ماڈل بند کریں۔ 'func:`~tinamit.BF.ModeloImpaciente.cerrar_modelo:

source: :func:`~tinamit.BF.ModeloImpaciente._inic_dic_vars`: Incializa el diccionario interno de variables disponibles.
ur: دستیاب متغیر کی اندرونی لغت کو شروع کریں۔ 'func:`~tinamit.BF.ModeloImpaciente._inic_dic_vars`:

source: :func:`~tinamit.BF.ModeloImpaciente.avanzar_modelo`: Avanza la simulación del paso mínimo del modelo (por ejemplo, avanzará un modelo anual de 1 año, aunque este de resultados con una precisión de 1 mes). No te preoccupes, Tinamït arreglará todo.
ur: نمونے کی پیش رفت کے کم از کم مرحلے کا تخروپن (مثال کے طور پر، 1 سال کے ليے سالانہ نمونہ آگے بڑھايا جائے گا، اگرچہ اس میں 1 مہینہ کی درستگیہو). پریشان نہ ہوں، ٹينامٹ خود بخود سب کچھ ٹھیک کرے گا.

source: :func:`~tinamit.BF.ModeloImpaciente.leer_archivo_vals_inic`: Lee un archivo con valores inciales para la simulación.
ur: تخروپن کے لئے ابتدائی اقدار کے ساتھ ایک دستاويز پڑھیں. 'func:`~tinamit.BF.ModeloImpaciente.leer_archivo_vals_inic:

source: :func:`~tinamit.BF.ModeloImpaciente.leer_archivo_egr`: Le un archivo de los egresos de una simulación.
ur: ایک تخروپن کے راستے کی ایک فائل۔ 'func:`~tinamit.BF.ModeloImpaciente.leer_archivo_egr:

source: :func:`~tinamit.BF.ModeloImpaciente.escribir_archivo_ingr`: Escribe un archivo de ingresos para el modelo, basado en los valores de los variables internos actuales.
ur: موجودہ اندرونی متغیرات کے مطابق، ماڈل کے لئے ایک آمدنی دستاويز لکھیں۔ 'func:`~tinamit.BF.ModeloImpaciente.escribir_archivo_ingr:

source: Un ejemplo sería la envoltura para SAHYSMOD, :class:`~tinamit.EnvolturaBF.en.SAHYSMOD.SAHYSMOD_Wrapper`.
ur: مثال کے طور پر يہ سانچہ SAHYSMOD کے ليے ہو گا۔ 'class:`~tinamit.EnvolturaBF.en.SAHYSMOD.SAHYSMOD_Wrapper:

source: Plantilla ModeloFlexible
ur: سانچہ لچکدار۔

source: Un ejemplo de esta plantilla sería la envoltura para el modelo de cultivos DSSAT. Simplemente debes implementar las funciones siguientes en una subclase:
ur: فصل کے نمونہ DSSAT کے لئے سانچنے کی ايک مثال۔ آپ کو ذیلی طبقے میں مندرجہ ذیل افعال کو لاگو کرنا ہوگا۔

source: Esta plantilla todavía está en desarrollo.
ur: اس سانچےپر اب بھی کام ہو رھا ہے.

source: :func:`~tinamit.BF.ModeloFlexible.iniciar_modelo`: Inicializa la simulación.
ur: تخروپن کو شروع کریں۔ 'func:`~tinamit.BF.ModeloFlexible.iniciar_modelo:

source: :func:`~tinamit.BF.ModeloFlexible.cerrar_modelo`: Cierre el modelo al final de una simulación.
ur: تخروپن کے اختتام پر ماڈل بند کریں۔ 'func:`~tinamit.BF.ModeloFlexible.cerrar_modelo:

source: :func:`~tinamit.BF.ModeloFlexible._inic_dic_vars`: Incializa el diccionario interno de variables disponibles.
ur: دستیاب متغیر کی اندرونی لغت کو شروع کریں۔ 'func:`~tinamit.BF.ModeloFlexible._inic_dic_vars:

source: :func:`~tinamit.BF.ModeloFlexible.mandar_modelo`: Avanza la simulación.
ur: تخروپن کو فروغ دینا۔ 'func:`~tinamit.BF.ModeloFlexible.mandar_modelo:

source: :func:`~tinamit.BF.ModeloFlexible.leer_archivo_vals_inic`: Lee un archivo con valores inciales para la simulación.
ur: تخروپن کے لئے ابتدائی اقدار کے ساتھ ایک دستاويز پڑھیں۔ 'func:`~tinamit.BF.ModeloFlexible.leer_archivo_vals_inic:

source: :func:`~tinamit.BF.ModeloFlexible.leer_archivo_egr`: Le un archivo de los egresos de una simulación.
ur: تخروپن کے راستے کی ایک دستاويز۔ 'func:`~tinamit.BF.ModeloFlexible.leer_archivo_egr:

source: :func:`~tinamit.BF.ModeloFlexible.escribir_archivo_ingr`: Escribe un archivo de ingresos para el modelo, basado en los valores de los variables internos actuales.
ur: موجودہ اندرونی متغیرات کے مطابق، نمونے کے لئے ایک آمدنی کی دستاويز لکھیں۔ 'func:`~tinamit.BF.ModeloFlexible.escribir_archivo_ingr:

source: Un ejemplo sería la envoltura para DSSAT, :class:`~tinamit.EnvolturaBF.es.DSSAT.envoltDSSAT`.
ur: DSSAT کی مثال کے ليے ايک جلد ہو گی۔ 'class:`~tinamit.EnvolturaBF.es.DSSAT.envoltDSSAT:

source: Cambios climáticos
ur: موسمیاتی تبدیلیاں۔

source: Si tu modelo incluye variables climáticos, deberías considerar escribirlo para que pueda comunicar con las funcionalidades de cambios climáticos de Tinamït. Esto permitirá que Tinamït actualize los valores de estos variables según el escenario climático escogido por el usuario.
ur: اگر آپ کے نمونے میں موسمی متغیرات شامل ہیں تو آپ کو اسے لکھنے پر غور کرنا چاہیے تاکہ یہ ٹينامٹ آب و ہوا کی تبدیلی کی فعالیت کے ساتھ ردوبدل کرسکیں. یہ ٹينامٹ کے صارف کو منتخب کردہ موسمی حالات کے مطابق ان متغیرات کی قیمتوں کو تاذہ کرنے کی اجازت دیتا ہے.

source: Cuando un usuario corre un modelo con un escenario climático, cada modelo conectado se conectará automáticamente, por su atributo ``.lugar``, con un objeto :class:`~tinamit.Geog.Geog.Lugar`. Si tu modelo requiere datos climáticos con la **misma precisión que su paso**, simplemente puedes llamar la función :func:`~tinamit.Modelo.Modelo.conectar_var_clima` en su método :func:`~tinamit.BF.ModeloBF.__init__`. Por ejemplo, en la envoltura de SAHYSMOD::
ur: جب ایک صارف آب و ہوا کے منظر کے ساتھ نمونہ چلاے گا۔ ہر منسلک نمونہ اسے خود کار طریقے سے منسلک کرے گا، اس کے ليے يہ ``.lugar`` ذریعے کے طور پر استعمال کرے گا۔ 'class:`~tinamit.Geog.Geog.Lugar: اگر آپ کو نمونے کے ساتھ آب و ہوا کے اعداد و شمار کی ضرورت ہے۔ ٭٭آپکے ‍‍‍قدم کے مطابق درستگی**.اس طریقہ کار میں آپ صرف فعل'func:`~tinamit.Modelo.Modelo.conectar_var_clima: کو کال کرسکتے ہیں. مثال کے طور پر، '__SAHYSMOD :func:`~tinamit.BF.ModeloBF.__init کے سانچنے کے ليے۔

source: Esta comanda conecta el variable interno ``Pp - Rainfall`` de la envoltura SAHYSMOD con el variable climático ``Precipitación``. En cada paso, Tinamït actualizará este variable con el valor ``total`` de precipitación en cada paso de la simulación para el escenario climático apropiado. Chévere, ¿no?
ur: یہ حکم اندرونی متغیر جوڑتا ہے۔SAHYSMOD کے سانچے ميں متغیر ``Pp - Rainfall`` موسمی متغیر `Precipitación`` کے ساتھ۔ ٹينامٹ مناسب موسمی منظر کے لئے تخروپن کے ہر قدم میں قیمت `` کل`` کے ساتھ اس متغیر کو تاذہ کرےگا . ڈاؤن لوڈ نہیں کرے گا۔

source: El parámetro ``var`` es el nombre de este variable en tu envoltura. Puede ser lo que quieres, en el idioma que quieres. La opciones actuales para variables climáticos (``var_clima``) incluyen:
ur: يہ متغیر `` var`` آپکی جلد ميں اس اعداد و شمار کا نام ہے۔ جو آپ چاہتے ہیں اور جس ذبان ميں چاہتے ہیں يہ وہ ہو سکتا ہے۔ موسمی متغیرات کے لئے موجودہ اختیار (`` var_clima``)شامل ہے۔

source: ``Precipitación`` : mm
ur: Precipitación`` : mm'' بارش۔

source: ``Radiación solar`` : MJ / m2 / día
ur: Radiación solar`` : MJ / m2 / día'' شمسی توانائی کی تابکاری۔

source: ``Temperatura máxima`` : grados C
ur: Temperatura máxima`` : grados C'' زیادہ سے زیادہ درجہ حرارت۔

source: ``Temperatura promedia`` : grados C
ur: Temperatura promedia`` : grados C'' اوسط درجہ حرارت

source: ``Temperatura mínima`` : grados C
ur: Temperatura mínima`` : grados C'' کم از کم درجہ حرارت۔

source: ``Combin`` puede ser ``prom`` (calculará el promedio de este variable climático por el periodo deseado) o ``total`` (calculará el total, como para lluvia). Si no se especifica, se supondrá ``total`` para ``Precipitación`` y ``prom`` para todos los otrs variables climáticos.
ur: ''prom'' ''Combin`` ہوسکتا ہے۔ (مطلوبہ مدت کے لئے اس موسمی متغیر کی اوسط کا حساب کرے گا) يا `` total`` (یہ بارش کے لئےکل کا حساب کرے گا)۔ اگر يہ مخصوص نہ ہو تو ،`` total`` بارش کے لئے اور `` prom`` دیگر تمام متغیرات کے لئے سمجھا جا‏‏ئے گا۔

source: Si, al contrario, tu modelo necesita variables climáticos **con un paso distinto del suyo** (por ejemplo, un modelo de cultivos necesita que los variables climáticos diarios se escriben en un archivo separado antes de empezar la simulación), lo tendrás que implementar en :func:`~tinamit.BF.ModeloBF.iniciar_modelo`. Puedes acceder los variables climáticos que quieres con el método :func:`~tinamit.Geog.Geog.Lugar.devolver_datos` de ``símismo.lugar``.
ur: اگراس کے برعکس، آپ کا ماڈل موسمیاتی متغیرات کی ضرورت ہے ٭٭مختلف قدم سے٭٭ (مثال کے طور پر، ایک فصل نمونے کا تقاضا ہے کہ روزانہ موسمیاتی متغیر تخروپن شروع کرنے سے پہلے علیحدہ دستاويز میں لکھیں)۔آپ کو اس میں فغل 'func:`~tinamit.BF.ModeloBF.iniciar_modelo: لاگو کرنا ہوگا۔ آپ ایسے متعدد متغیرات تک رسائی حاصل کرسکتے ہیں جو آپ چاہتے ہیں۔ 'func:`~tinamit.Geog.Geog.Lugar.devolver_datos: ميں ``símismo.lugar``۔
