Repository: JamesJulius/Tinamit
Catalog: docs/source/_local/*/LC_MESSAGES/index.po
Languages: ta

source: Tinamït
ta: தீநாமித்

source: Versión: |version|
ta: பதிப்புரு: |version|

source: Tinamït es un programa para conectar modelos socioeconómicos (dinámicas de los sistemas) con modelos biofísicos.
ta: தீனாமித் என்று செய்நிரலால் சமூக பொருளாதார அமைப்பு இயக்கவியல் மற்றும் உயிர் இயற்பியல் மாதிரிகளை இணைக்கட்டும்.

source: Tinamït permite la conexión rápida, flexible y reproducible de modelos con:
ta: தீனாமித்தால் மாதிரிகள் வேகமான, நெகிழ்வான மற்றும் நம்பக்கமான முறையால் சேர்க்கப்படும்.

source: Un interfaz (IGU) para los que no quieren escribir código.
ta: கணினி குறியீடு எழுத வேண்டாதவர்களுக்கு ஒரு வரைகலை இடைமுகம்.

source: Un libreria (IPA) para las que sí.
ta: குறியீடு பிடித்தவர்களுக்கு, ஒரு பயன்பாடு நிரலாக்க இடைமுகம்.

source: Una estructura fácil para conectar modelos en menos de 10 líneas (en vez de cientos).
ta: பத்து குறியீடு வரிக்குள்ளே மாதிரிகளை இணைக்கிறதற்கு சுலபமான அமைப்பு.

source: Una estructura transparente para que todos puedan agregar modelos y recursos.
ta: வெளிப்படையான அமைப்பு, அப்படி புது மாதிரிகளை மற்றும் வளங்களை சேர்க்க எல்லோருக்கும் சுலபமாக இருக்கும்.

source: Apoyo multilingual en el IGU.
ta: பல்மொழி வரைகலை இடைமுகம்

source: ¿Quieres contribuir?
ta: உங்களுக்க பங்களிக்க வேண்டுமா.

source: Puedes **agregar modelos**, desarrollar **nuevas funcionalidades**, o ayudar a **traducir Tinamït** en tu lengua preferida. Lo explicamos todo :ref:`aquí <desarrollo>`.
ta: நீங்கள் **மாதிரிகளை சேர்கட்டும்**, **புது செய்லபாடுகளை** உருவாக்கட்டும், மேலும் தீனாமித்தை உங்களுக்கு பிடித்த மொழியில் **மொழிபெயர்ப்பு செய்யட்டும்**. தேவையான தகவல்கள் எல்லாம் :ref:`இங்கே <desarrollo>` கிடைக்கும்.

source: Contacto: |correo|
ta: தொடர்பு: |correo|

source: Índice:
ta: சுட்டுவரிசை
