Repository: JamesJulius/Tinamit
Catalog: docs/source/_local/*/LC_MESSAGES/sphinx.po
Languages: ta

source: Search within %(docstitle)s
ta: %(docstitle)s-இல் தேடு

source: About these documents
ta: இந்த ஆவணங்களை பற்றி

source: Index
ta: அட்டவணை

source: Search
ta: தேடு

source: Copyright
ta: காப்புரிமை

source: Next
ta: முன்

source: Previous
ta: பின்

source: &copy; <a href="%(path)s">Copyright</a> %(copyright)s.
ta: &copy; <a href="%(path)s">காப்புரிமை</a> %(copyright)s.

source: &copy; Copyright %(copyright)s.
ta: &copy; காப்புரிமை %(copyright)s.

source: <span class="build"> Build <a href="%(build_url)s">%(build_id)s</a>. </span>
ta: <span class="build"> தொகுப்பு <a href="%(build_url)s">%(build_id)s</a>. </span>

source: <span class="commit"> Revision <code>%(commit)s</code>. </span>
ta: <span class="commit"> திருத்தம்<code>%(commit)s</code>. </span>

source: Last updated on %(last_updated)s.
ta: கடைசியான மேம்படுத்தல் %(last_updated)s.

source: Built with <a href="http://sphinx-doc.org/">Sphinx</a> using a <a href="https://github.com/snide/sphinx_rtd_theme">theme</a> provided by <a href="https://readthedocs.org">Read the Docs</a>
ta: <a href="http://sphinx-doc.org/">ஸ்ஃபிக்ஸ்</a> மற்றும் <a href="https://readthedocs.org">ரீட் த டாக்ஸால்</a> வழங்கப்படும் <a href="https://github.com/snide/sphinx_rtd_theme">கருப்பொருளால்</a> தொகுப்பு செய்யப்பட்டது
