Repository: JamesJulius/Tinamit
Catalog: docs/source/_local/*/LC_MESSAGES/docu/Unidades.po
Languages: ta

source: Manejo de Unidades
ta: அலகு மேலாண்மை

source: Este módulo maneja la conversión automática de unidades en Tinamït.
ta: தீனாமித்தில் தனியங்கி அலகு மாற்றம் இந்த தொகுதியால் செய்யப்பட்டது.

source: Esta función convierte un valor de una unidad a otra.
ta: இந்க தெயல்பாட்டால் ஒரு மதிப்பின் அலகு மாற்றுலாம்.

source: Parámetros
ta: சுட்டளவுகள்

source: La unidad original.
ta: மூல் அலகு

source: La unidad final.
ta: வேண்டிய அலகு

source: El tipo de unidad ('tiempo', 'distancia', etc.) No es obligatoria.
ta: அலகின் வகை. உதாரணத்துக்கு, நேரம், தூரம், அதி. குறிப்பிட தேவை இல்லை.

source: El valor para convertir.
ta: மூல் மதிப்பு

source: La lengua en la cuál se están especificando las unidades.
ta: அலகுகளின் மொழி.

source: Devuelve
ta: திரும்ப மதிப்பு

source: El valor convertido.
ta: மாற்றப்பட்ட மதிப்பு

source: Tipo del valor devuelto
ta: திரும்பி எண் வகை

source: Esta función convierte una unidad sencilla a otra.
ta: இந்த செயல்ப்பாட்டால் சுலபமான அலகு மாற்றும் செய்யப்பட்டது.

source: El tipo de unidad ('tiempo', 'distancia', etc.)
ta: அலகின் வகை ('நேரம்', 'தூரம்', அதி)
